在网上看到一名博主的经历和我非常相似，很受感动鼓舞，享受着网上这么多博
主的资源，学习经验，所以决定仿照着写写自己这一年来的感悟，github上更新
博客不定时 ，但是陆陆续续会写一点吧。

说说我自己吧。我是一名计算机专业的研究生。读研之前一直在迷茫：究竟是
去做技术还是回家做生意，技术的话是技多不压身还是贪多嚼不烂。本科的时候，
我没有好好的学习，成绩一般般，只拿过一次三等奖，成绩在30%左右，我想
大家都应该知道这是一种什么样的水平。成为一名普通的学生，所以很多时候感
觉自己比较平凡，没什么亮点，但是也从来不觉得自己笨。所以后面一年就
开始自学，包括Java，计算机网络，数据结构和算法，MySQL，Redis等等。

研一一年是我过得最充实最努力的一年，甚至我觉得是个可以改变之后一生的一年。
期间我翘了一些我认为无关痛痒的课，像是英语，中国特色社会主义，马克思哲学。
一有时间就跑教研室，自己抱着专业出名的的书啃，看累了就刷刷leetcode编程题
,期间组队参加IEEE校内编程比赛，拿了个第9/80名，赚了两百块钱，成为很多人眼
中所谓的“比较厉害的人”。但是我知道，我只是比他们早学了和多投入了一点时间
罢了。成绩上也奇怪，最后发现自己用着书，看得飞快，考试结果也很不错，专业
成绩大概是29/351，前10%，幸运地拿了个二等奖。

心态的改变让我重新认识了我自己，后来抱着试一试的态度，开始做一些竞赛。
但是很多东西都不会，比赛的时候需要一个完整的项目（基于H5的客服报修，智
能的垃圾桶） ，那个时候前端的html,JS ，CSS都不会 ，连bootstrap都不知道，就
傻傻地照着一个网站改，但是为了做出来 ，一有时间就跑网站学，买了个折叠床到教
研室 ，累了就躺躺，不累就接着看，最后有惊无险地通过 。

这个时候别人会觉得你很厉害 ，成绩不错 ，技术什么都会一点 ，什么都懂一点
 ，但是事实上自己清楚自己有几把刷子 ，这样子的“厉害”没啥用 ，碰到一个内行
 的，就是被吊打的节奏。所以蹭着研二还有一点时间 ，我想着深入一门技术学习，
 也就是找到自己的重心，最后考虑学Java吧









