在网上看到一名博主的经历和我非常相似，很受感动鼓舞，享受着网上这么多博主的资源，学习经验，所以决定仿照着写写自己这一年来的感悟，github上更新
博客不定时 ，但是陆陆续续会写一点吧。

说说我自己吧。我是一名计算机专业的研究生。读研之前一直在迷茫：究竟是去做技术还是回家做生意，技术的话是技多不压身还是贪多嚼不烂。本科的时候，
我没有好好的学习，成绩一般般，只拿过一次三等奖，成绩在30%左右，我想大家都应该知道这是一种什么样的水平。成为一名普通的学生，所以很多时候感
觉自己比较平凡，没什么亮点，但是也从来不觉得自己笨。所以后面一年就开始自学，包括Java，计算机网络，数据结构和算法，MySQL，Redis等等。

研一一年是我过得最充实最努力的一年，甚至我觉得是个可以改变之后一生的一年。期间我翘了一些我认为无关痛痒的课，像是英语，中国特色社会主义，马克思哲学。
一有时间就跑教研室，自己抱着专业出名的的书啃，看累了就刷刷leetcode编程题,期间组队参加IEEE校内编程比赛，拿了个三等奖，赚了两百块钱，成为很多人眼
中所谓的“比较靠谱的人”。但是我知道，真正厉害的同学，早就脱离这种比赛了，要么实习要么四大赛，我只是比一些人早学了和多投入了一点时间罢了。成绩上也奇怪，
越到后面越发现自己用着书，看得飞快，考试结果也很不错，专业成绩大概是29/351，前10%，幸运地拿了个二等奖。

心态的改变让我重新认识了我自己，后来抱着试一试的态度，开始做一些项目和科研部分。是很多东西都不会，比赛的时候需要一个完整的项目，那个时候前端的html,JS 
，CSS都不会 ，连bootstrap都不知道，就傻傻地照着一个网站改，写前端都是用着一个一个的H5照着写，但是为了做出来 ，一有时间就跑网站学，买了个折叠床到教研
室 ，累了就躺躺，不累就接着看，最后有惊无险地弄好 。

这个时候别人会觉得你不错了 ，成绩不错 ，技术什么都会一点 ，什么都懂一点 ，但是事实上自己清楚自己有几把刷子 ，这样子的“不错”没啥用 ，碰到一个内行
 的，就是被吊打的节奏。所以蹭着读书还有时间 ，我想着深入一门技术学习， 也就是找到自己的重心，最后考虑到实际企业应用广泛程度，学Java吧。 


目前学习书单 ：
    Java基础  ：  《Java编程的逻辑》（千万别去读编程思想那本书） + 不懂得找博客，结合看
    
     JVM   ：   《深入理解JVM》   +   纯洁的微笑的博客   
    
     Mysql :  《MySQL必知必会》   《高性能MySQL》1,4,5,6,7章    《MySQL技术内幕 ： InnoDB存储引擎》
     
     Redis :   http://www.runoob.com/redis/redis-tutorial.html操作教程 ，看完一遍，就知道怎么用了 ；《Redis开发与维护》                 
  
     数据结构和算法 ：  看教材一次   ，  橘皮书《算法》 ， 尤其红黑树和并查集，以及字符串匹配那里 ，写得真是好啊 ，无出其右
     
     Spring && Springboot :   看一个系列的博客 ，懂得Ioc和AOP大概概念就直接上手 ， 看是看不会的 ，做着做着就会了
     
     分布式 ： 这个看看zookeeper ， 就《从paxos到zookeeper》那本书大概看看 ，了解下CAP，zk应用场景什么的
     
     操作系统 ： 看看以前的教材 ，其实OS就分成 进程 ，内存 ，IO几块 ， Linux会用一点就好了。
     
     
     







